<?php

return [
    // 用户分组
    'group' => [
        'enterprise'     => [10, '企业公司'],
        'supplier'       => [20, '供应商'],
        'natural_person' => [30, '自然人'],
        'self_employ'    => [40, '个体工商户'],
        'admin'          => [99, '管理员'],
    ],

    // 用户类型
    'type'  => [
        'super'  => [10, '超级管理员'],
        'normal' => [20, '普通管理员'],
        'hidden' => [99, '隐藏管理员'],
    ],

    'login' => [
        /*
        |--------------------------------------------------------------------------
        | 用户登录后返回的token多久失效（单位：秒）
        |--------------------------------------------------------------------------
        |
        | 系统中每验证一次token会先获取该token的最后活动时间，
        | 如 当前时间 - 最后活动时间 大于 该值，则token失效
        | 否则更新token的最后活动时间为当前时间
        |
        */
        'token_expiry' => 15 * 86400,

        // 密码加密类型
        'pwd_type'     => [
            'password_hash' => 1,
        ],

        // 登录类型
        'type'         => [
            'phone' => [1, '手机号码登录'],
        ],
    ],
];